src_ext/Documents/УЗ_ПриходДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>УЗ_ПриходДенег</Name>
			<BasedOn>
				<xr:Item>Catalog.УЗ_ФизЛица</xr:Item>
				<xr:Item>Catalog.УЗ_Абонемент</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УЗ_СписанияСуммЗаУроки</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_Касса</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_ДвижениеДисконтныхКарт</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Абонемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтатьиДвиженияДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Родитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБонусов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ДисконтныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_ext/Enums/УЗ_ВидыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>УЗ_ВидыОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВнутренняяКасса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КассаУченики</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗарплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочийРасход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_ext/Documents/УЗ_Урок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>УЗ_Урок</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УЗ_СписанияСуммЗаУроки</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_Расходы</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_РасчетыПоЗарплате</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_ДвижениеДисконтныхКарт</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ГруппыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЗ_ДополнительныеРасходы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Педагог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Помещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Статусы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаПедагога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтавкиПедагогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБонусов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДопРасходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачисленоПедагогу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДомашнееЗадание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаУрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ученики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СписатьОплату</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Явка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ученик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Абонемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заметка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Причина</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_Скидки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДисконтнаяКарта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_ДисконтныеКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБонусов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НачисленияПедагогу</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачисления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеИзменять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_СтатьиДвиженияДенег</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_ext/Documents/УЗ_ПриходДенег/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//новый документ — на текущее время, а не на полночь
	Если Объект.Ссылка.Пустая() И Объект.Дата = НачалоДня(Объект.Дата) Тогда
		Сейчас = НачалоМинуты(ТекущаяДатаСеанса());
		Объект.Дата = НачалоДня(?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, Сейчас)) + (Сейчас - НачалоДня(Сейчас));
	КонецЕсли;

	Если Объект.Ссылка.Пустая() Тогда
		ЗаполнитьЗначенияСвойств(Объект,Параметры.ЗначенияЗаполнения);
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации";
	Если Запрос.Выполнить().Выгрузить().Количество() = 0 Тогда
		Элементы.Организация.Видимость = Ложь;
	КонецЕсли;

	//приход — только «Касса ученики» и «Внутренняя касса» (решение В7); расходные виды не проводятся
	Элементы.ВидОперации.РежимВыбораИзСписка = Истина;
	Элементы.ВидОперации.СписокВыбора.Очистить();
	Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.УЗ_ВидыОпераций.КассаУченики);
	Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.УЗ_ВидыОпераций.ВнутренняяКасса);

	//остаток бонусов — число (прежде у числа бралось поле .СуммаБонусовОстаток, и ПКО с картой не открывался)
	Если НЕ Объект.ДисконтнаяКарта.Пустая() Тогда
		ДоступноБонусов = РассчитатьОстатокБонусовНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	УЗ_ДатыЗапрета.ФормаПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	Если ЗначениеЗаполнено(Объект.СуммаБонусов) и НЕ ЗначениеЗаполнено(Объект.ДисконтнаяКарта) Тогда
		Сообщить("Не выбрана дисконтная карта! Так как выбрана оплата бонусами.");
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

//открытая карточка абонемента пересчитывает «Оплачено» (Справочник.УЗ_Абонемент, ОбработкаОповещения)
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Запись_УЗ_ПриходДенег", ПараметрыЗаписи, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьВидимость();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	КлиентПриИзмененииНаСервере();
КонецПроцедуры

//находка 2 третьего аудита Codex (28.09.2026): смена организации или предмета очищает абонемент другой организации
//или предмета — оплата абонемента остаётся в его разрезе
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	СогласоватьАбонемент();
КонецПроцедуры

&НаКлиенте
Процедура ПредметОбученияПриИзменении(Элемент)
	СогласоватьАбонемент();
КонецПроцедуры

//выбранный абонемент заполняет ученика, организацию и предмет — как приход на основании абонемента
&НаКлиенте
Процедура АбонементПриИзменении(Элемент)
	АбонементПриИзмененииНаСервере();
	ОбновитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ДисконтнаяКартаПриИзменении(Элемент)

	Если ЗначениеЗаполнено(Объект.ДисконтнаяКарта) Тогда
		ДоступноБонусов = РассчитатьОстатокБонусовНаСервере();
	Иначе
		ДоступноБонусов = 0;
	КонецЕсли;

	ОбновитьВидимость();

КонецПроцедуры

&НаКлиенте
Процедура ДисконтнаяКартаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыОтбора = Новый Структура("Владелец", Объект.ФизЛицо);
	ПараметрыОткрытия = Новый Структура("Отбор", ПараметрыОтбора);
	ОткрытьФорму("Справочник.УЗ_ДисконтныеКарты.ФормаВыбора", ПараметрыОткрытия, Элемент, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ДоступноДенегНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыОткрытия = ОткрытьДвиженяПоДисконтнойКартеНаСервере(Объект.ДисконтнаяКарта);
	ОткрытьФорму("Отчет.УЗ_ОтчетПоДисконтнымКартам.Форма", ПараметрыОткрытия, ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьТекстНазначенияПлатежа(Команда)

	Если ЗначениеЗаполнено(Объект.ФизЛицо) Тогда

		СписокУроков = ОпределитьСписокУроков();

		Объект.НазначениеПлатежа = "Ученик: " +Объект.ФизЛицо+
		?(ЗначениеЗаполнено(Объект.ПредметОбучения),", за предмет: " +Объект.ПредметОбучения,"")+
		?(СписокУроков<>"",", за уроки: " +СписокУроков,"");

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РассчитатьЗадолженность(Команда)

	Объект.СуммаДокумента = РассчитатьЗадолженностьНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВзаиморасчеты(Команда)

	Если ЗначениеЗаполнено(Объект.ФизЛицо) Тогда
		ПараметрыОткрытия = ОткрытьВзаиморасчетыНаСервере();
		ОткрытьФорму("Отчет.УЗ_Взаиморасчеты.Форма", ПараметрыОткрытия, ЭтаФорма);
	Иначе
		ОткрытьФорму("Отчет.УЗ_Взаиморасчеты.Форма", , ЭтаФорма);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РассчитатьОстатокБонусов(Команда)
	Если ЗначениеЗаполнено(Объект.ДисконтнаяКарта) Тогда
		ДоступноБонусов = РассчитатьОстатокБонусовНаСервере();
	Иначе
		Сообщить("Не выбрана дисконтная карта!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСуммуПоТарифу(Команда)

	Если ЗначениеЗаполнено(Объект.Тариф) Тогда
		Объект.СуммаДокумента = ПолучитьСуммуПоТарифуНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДвиженияДокумента(Команда)
	ДанныеС = Новый Структура;
	ДанныеС.Вставить("Документ",Объект.Ссылка);
	ОткрытьФорму("Отчет.УЗ_ДвиженияДокумента.Форма.ДвиженияДокумента",ДанныеС ,ЭтаФорма, , , , ,
		РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура КлиентПриИзмененииНаСервере()

	Объект.Родитель = Неопределено;
	Объект.ДисконтнаяКарта = Неопределено;

	Если НЕ Объект.ФизЛицо.Пустая() Тогда
		Объект.Родитель = Объект.ФизЛицо.Родитель1;
	КонецЕсли;
	СогласоватьАбонемент();

КонецПроцедуры

//Абонемент другого ученика, организации или предмета (Документы.УЗ_ПриходДенег.ТекстНесогласованногоАбонемента —
//та же проверка, что при проведении) очищается с пояснением.
&НаСервере
Процедура СогласоватьАбонемент()

	Текст = Документы.УЗ_ПриходДенег.ТекстНесогласованногоАбонемента(Объект.Абонемент, Объект.ФизЛицо,
		Объект.Организация, Объект.ПредметОбучения, Объект.ВидОперации);
	Если ЗначениеЗаполнено(Текст) Тогда
		Объект.Абонемент = Справочники.УЗ_Абонемент.ПустаяСсылка();
		УЗ_ОбщийКлиентСервер.СообщитьПользователю(Текст + " " + НСтр("ru = 'Абонемент очищен.'"), "Абонемент",
			"Объект");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура АбонементПриИзмененииНаСервере()

	Абонемент = Объект.Абонемент;
	Если НЕ ЗначениеЗаполнено(Абонемент) Тогда
		Возврат;
	КонецЕсли;
	Объект.ВидОперации = Перечисления.УЗ_ВидыОпераций.КассаУченики;
	Если Объект.ФизЛицо <> Абонемент.ФизЛицо Тогда
		Объект.ФизЛицо = Абонемент.ФизЛицо;
		Объект.Родитель = Объект.ФизЛицо.Родитель1;
		Объект.ДисконтнаяКарта = Неопределено;
		ДоступноБонусов = 0;
	КонецЕсли;
	Если ЗначениеЗаполнено(Абонемент.Организация) Тогда
		Объект.Организация = Абонемент.Организация;
	КонецЕсли;
	Если ЗначениеЗаполнено(Абонемент.ПредметОбучения) Тогда
		Объект.ПредметОбучения = Абонемент.ПредметОбучения;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ОпределитьСписокУроков()

	//неоплаченные уроки — из регистра денег ученика в организации ПКО на момент ПКО без него самого
	//(УЗ_Сервер.НеоплаченныеУрокиУченика); прежде — сумма документов ПКО по всем организациям
	Граница = ?(Объект.Ссылка.Пустая(), Неопределено,
		Новый Граница(Объект.Ссылка.МоментВремени(), ВидГраницы.Исключая));
	Уроки = УЗ_Сервер.НеоплаченныеУрокиУченика(Объект.ФизЛицо, Объект.Организация,
		?(ЗначениеЗаполнено(Объект.ПредметОбучения), Объект.ПредметОбучения, Неопределено), Граница);
	Даты = Новый Массив;
	Для Каждого ДатаУрока Из Уроки Цикл
		Даты.Добавить(Формат(ДатаУрока, "ДФ='дд.ММ.гггг (ЧЧ:мм)'"));
	КонецЦикла;
	Возврат СтрСоединить(Даты, ", ");

КонецФункции

&НаСервере
Функция РассчитатьЗадолженностьНаСервере()

	//В12: долг ученика — в организации ПКО (деньги учеников раздельно по организациям); по предмету — за вычетом
	//аванса, внесённого без предмета (иначе ПКО по предмету предлагал взять деньги второй раз), без предмета — по
	//всем предметам. Одна функция с «Назначением платежа» — УЗ_Сервер.ЗадолженностьУченика.
	Возврат УЗ_Сервер.ЗадолженностьУченика(Объект.ФизЛицо, Объект.Организация,
		?(ЗначениеЗаполнено(Объект.ПредметОбучения), Объект.ПредметОбучения, Неопределено));

КонецФункции

&НаСервере
Функция ОткрытьВзаиморасчетыНаСервере()

	Возврат УЗ_Общий.ПараметрыОткрытияОтчета("УЗ_Взаиморасчеты",
		Новый Структура("Клиент, Тариф", Объект.ФизЛицо, Объект.Тариф));
КонецФункции

&НаСервере
Функция РассчитатьОстатокБонусовНаСервере()
	//карта без движений — 0 (прежде Неопределено, и на экране оставался остаток прошлой карты)
	Возврат Документы.УЗ_ПриходДенег.ОстатокБонусовКарты(Объект.ДисконтнаяКарта);
КонецФункции

&НаСервере
Функция ОткрытьДвиженяПоДисконтнойКартеНаСервере(Значение)

	Возврат УЗ_Общий.ПараметрыОткрытияОтчета("УЗ_ОтчетПоДисконтнымКартам",
		Новый Структура("ДисконтнаяКарта", Значение));
КонецФункции

&НаСервере
Функция ПолучитьСуммуПоТарифуНаСервере()

	//Р6: цена тарифа на дату документа — та же функция, что у урока (история цен, В8); прежде — «Сумма» карточки
	Цена = Документы.УЗ_Урок.ЦенаТарифаНаДату(Объект.Тариф, Объект.Дата);
	Возврат ?(Цена = Неопределено, 0, Цена.Сумма);

КонецФункции

Процедура ОбновитьВидимость()

	Если Объект.ДисконтнаяКарта.Пустая() Тогда
		Элементы.СуммаБонусов.Доступность = Ложь;
		Объект.СуммаБонусов = 0;
	Иначе
		Элементы.СуммаБонусов.Доступность = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
